#include <REGX52.H>
#include "delay.h"
void main()
{   
    unsigned char LEDNum = 0;   //8位二进制数

    while (1)
    {   
        if(P3_1==0){
        
        //按钮消抖操作
        Delay(20);
        while(P3_1==0);     //等待变为高电平（即松开按键）
        Delay(20);

        //P2初始为1111 1111  P2 = 0xFF;
        LEDNum++;
        P2=~LEDNum;
        //共8个LED，取低四位，低电平有效
        //LEDNum=1时，0000 0001，取反后为1111 1110，P2=0XFE，LED1亮，表示1
        //LEDNum=2时，0000 0010，取反后为1111 1101，P2=0XFD，LED2亮，表示2
        //LEDNum=3时，0000 0011，取反后为1111 1100，P2=0XFC，LED1、2亮，表示3
        //LEDNum=4时，0000 0100，取反后为1111 1011，P2=0XFB，LED1、2、3亮，表示4
        //·······
        //LEDNum=16时，0000 1111，取反后为1111 0000，P2=0XF0，LED1、2、3、4亮，表示16
        //LEDNum=17时，0001 0000，取反后为1110 1111，P2=0XEF，LED5亮，表示17
        //LEDNum=18时，0001 0001，取反后为1110 1110，P2=0XEE，LED1、5亮，表示18
        //·······
        //LEDNum=255时，1111 1111，取反后为0000 0000，P2=0X00，LED全亮
        //继续增加到256溢出回到P2=0XFE，LED1亮

        }
        
    } 
}